const { sendMainMenu } = require('../utils/helpers');

function handleStartCommand(bot, msg) {
  const chatId = msg.chat.id;
  const welcomeMessage = `
*Приветствую вас!*

Я — ваш персональный помощник в мире вина. Готов помочь вам подобрать идеальный напиток для любого случая или настроения, а также поддержать вас в отслеживании трезвости. 

Введите ваши предпочтения или просто поделитесь своим настроением, и я предложу наилучший вариант. Вот что я умею:

  • Рекомендовать вино на основе ваших предпочтений и ситуации
  • Учитывать погоду в вашем городе при выборе вина
  • Предлагать сочетания вина с едой
  • Отслеживать ваше состояние трезвости и напоминать о необходимости пить воду

Вы можете выбрать один из пунктов меню ниже или просто рассказать мне, какое вино вы хотите или для какого случая вам нужна рекомендация. Я с удовольствием помогу!
`;

  bot.sendMessage(chatId, welcomeMessage, { parse_mode: 'Markdown' });
  // Вызываем основное меню после приветственного сообщения
  sendMainMenu(bot, chatId, "Что бы вы хотели сделать дальше?");
}

module.exports = { handleStartCommand };